In [2]:
#import library
import pandas as pd
import numpy as np

In [5]:
import matplotlib.pyplot as plt
import os
import scipy.stats as sts
%matplotlib inline

In [6]:
os.getcwd() #directory

'/Users/khanhp/Documents/Dev/Python for Data Science/pythonfordataanalysis'

In [8]:
ls

Data Exploration.ipynb             test_predictdata.csv
README.md                          train_predictdata.csv
sample_submission_predictdata.csv

In [9]:
df = pd.read_csv('train_predictdata.csv') #reading csv file

In [10]:
df.head() # first row of the dataset

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [11]:
df.dtypes

Loan_ID               object
Gender                object
Married               object
Dependents            object
Education             object
Self_Employed         object
ApplicantIncome        int64
CoapplicantIncome    float64
LoanAmount           float64
Loan_Amount_Term     float64
Credit_History       float64
Property_Area         object
Loan_Status           object
dtype: object

In [14]:
df.describe(include=['float64']) #get summary of numerical variables

       CoapplicantIncome  LoanAmount  Loan_Amount_Term  Credit_History
count         614.000000  592.000000         600.00000      564.000000
mean         1621.245798  146.412162         342.00000        0.842199
std          2926.248369   85.587325          65.12041        0.364878
min             0.000000    9.000000          12.00000        0.000000
25%             0.000000  100.000000         360.00000        1.000000
50%          1188.500000  128.000000         360.00000        1.000000
75%          2297.250000  168.000000         360.00000        1.000000
max         41667.000000  700.000000         480.00000        1.000000

In [16]:
df.describe(include=['object']) #get summary of categorical variables

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,Property_Area,Loan_Status
count,614,601,611,599,614,582,614,614
unique,614,2,2,4,2,2,3,2
top,LP002348,Male,Yes,0,Graduate,No,Semiurban,Y
freq,1,489,398,345,480,500,233,422

In [17]:
df.columns

Index(['Loan_ID', 'Gender', 'Married', 'Dependents', 'Education',
       'Self_Employed', 'ApplicantIncome', 'CoapplicantIncome', 'LoanAmount',
       'Loan_Amount_Term', 'Credit_History', 'Property_Area', 'Loan_Status'],
      dtype='object')

In [18]:
#Apply Function
#Create a new function:
def num_missing(x):
  return sum(x.isnull())
#Applying per column:
print("Missing values per column:")
print(df.apply(num_missing, axis=0)) #axis=0 defines that function is to be applied on each column

Missing values per column:
Loan_ID               0
Gender               13
Married               3
Dependents           15
Education             0
Self_Employed        32
ApplicantIncome       0
CoapplicantIncome     0
LoanAmount           22
Loan_Amount_Term     14
Credit_History       50
Property_Area         0
Loan_Status           0
dtype: int64

In [ ]:
temp1 = df['Credit_History'].value_counts(ascending=True) 
temp2 = df.pivot_table(values='Loan_Status',index=['Credit_History'],aggfunc=lambda x: x.map({'Y':1,'N':0}).mean()) 
print('Frequency Table for Credit History:\n %s' %(temp1))
# print temp1 
print('\nProbility of getting loan for each Credit History class:')
print(temp2)